/****************************************************
*
*作者    ：周平
*邮箱    : zhpg_0803@163.com
*创建日期: 2016年7月19日10:11:32
*编译环境: MDK5.14
*文件名  ：timer.h
*功能    ：提供定时相关的功能函数
* 
*****************************************************/
#ifndef __MYTIMER_H__
#define __MYTIMER_H__

#include "sys.h"
#include "ucos_ii.h"

/******************************定时器3开始********************************/
extern void TIM3_Int_Init(u16 arr,u16 psc);

//启动定时器3
extern void TIM3_Start(void);

//关闭定时器3
extern void TIM3_Stop(void); 

//获取定时器3运行时间，单位0.1ms
extern unsigned long GetRunTime(void);
/******************************定时器3结束*********************************/


/******************************定时器4开始********************************/
extern void TIM4_Int_Init(u16 arr,u16 psc);

//启动定时器4
extern void TIM4_Start(void);

//关闭定时器4
extern void TIM4_Stop(void);

//获取定时器4运行时间，单位1ms(得根据定时器4的配置)
extern unsigned long GetRunMsCnt(void);
/******************************定时器4结束*********************************/




/******************************定时器7起始*********************************/

extern void TIM7_Int_Init(u16 arr,u16 psc);

/******************************定时器7结束*********************************/

#endif

